tap "1password/tap"
tap "elastic/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/services"
tap "infisical/get-cli"
tap "mklement0/ttab", "https://github.com/mklement0/ttab.git"
tap "romkatv/powerlevel10k"
tap "shopify/shopify"
tap "stripe/stripe-cli"
brew "xz"
brew "openssl@3"
brew "libgit2"
brew "bat"
brew "boost"
brew "fontconfig"
brew "glib"
brew "libevent"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "emacs"
brew "cask"
brew "cloc"
brew "diff-so-fancy"
brew "folly"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "edencommon"
brew "harfbuzz"
brew "pango"
brew "ffmpeg"
brew "flyctl"
brew "fzf"
brew "gh"
brew "libidn"
brew "ghostscript"
brew "gist"
brew "git"
brew "libassuan"
brew "gnupg"
brew "gpgme"
brew "guile"
brew "hdf5"
brew "shared-mime-info"
brew "libheif"
brew "liblqr"
brew "imagemagick"
brew "ios-deploy"
brew "jless"
brew "jq"
brew "libfido2"
brew "libgsf"
brew "librsvg"
brew "libyaml"
brew "llvm"
brew "mas"
brew "mysql"
brew "node"
brew "neonctl"
brew "ollama"
brew "pmix"
brew "open-mpi"
brew "opensearch", restart_service: :changed
brew "openslide"
brew "openssl@1.1"
brew "poppler"
brew "postgresql@14"
brew "postgresql@15", restart_service: :changed
brew "postgresql@16", restart_service: :changed
brew "postgresql@17", restart_service: :changed
brew "powerlevel10k"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pygments"
brew "python@3.10"
brew "python@3.11"
brew "python@3.12"
brew "python@3.9"
brew "ruby-build"
brew "rbenv"
brew "redis", restart_service: :changed
brew "ripgrep"
brew "ruby-install"
brew "rust"
brew "thefuck"
brew "tree"
brew "watchman"
brew "wget"
brew "yarn"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "heroku/brew/heroku"
brew "infisical/get-cli/infisical"
brew "mklement0/ttab/ttab"
brew "shopify/shopify/shopify-cli"
brew "stripe/stripe-cli/stripe"
cask "1password-cli"
cask "alfred"
cask "dash"
cask "figma"
cask "font-hack-nerd-font"
cask "ghostty"
cask "localxpose"
cask "ngrok"
cask "nordvpn"
cask "notion-calendar"
cask "numi"
cask "raycast"
cask "spark-app"
cask "spotify"
cask "visual-studio-code"
cask "warp"
cask "zoom"
vscode "aaron-bond.better-comments"
vscode "aki77.rails-db-schema"
vscode "alefragnani.project-manager"
vscode "alexcvzz.vscode-sqlite"
vscode "andrewmcgoveran.react-component-generator"
vscode "aslamanver.vsc-export"
vscode "atomiks.moonlight"
vscode "benjaminbenais.copilot-theme"
vscode "bourhaouta.tailwindshades"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "bradlc.vscode-tailwindcss"
vscode "bung87.vscode-gemfile"
vscode "castwide.solargraph"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "clinyong.vscode-css-modules"
vscode "csstools.postcss"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "deque-systems.vscode-axe-linter"
vscode "durzn.brackethighlighter"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "file-icons.file-icons"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "fwcd.kotlin"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gracefulpotato.rbs-syntax"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-execution"
vscode "graphql.vscode-graphql-syntax"
vscode "gusto.packwerk-vscode"
vscode "hridoy.rails-snippets"
vscode "ibm.output-colorizer"
vscode "itarato.byesig"
vscode "jasonnutter.search-node-modules"
vscode "jawandarajbir.react-vscode-extension-pack"
vscode "jomeinaster.bracket-peek"
vscode "kaiwood.endwise"
vscode "kamikillerto.vscode-colorize"
vscode "kingwl.vscode-vitest-runner"
vscode "kohlbachjan.the-best-theme"
vscode "koichisasada.vscode-rdbg"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "luxcium.pop-n-lock-theme-vscode"
vscode "mechatroner.rainbow-csv"
vscode "mgmcdermott.vscode-language-babel"
vscode "mikestead.dotenv"
vscode "mkxml.vscode-filesize"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.sublime-keybindings"
vscode "ms-vscode.vscode-speech"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "ms-windows-ai-studio.windows-ai-studio"
vscode "naumovs.color-highlight"
vscode "neotan.vscode-auto-restart-typescript-eslint-servers"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "qwtel.sqlite-viewer"
vscode "rangav.vscode-thunder-client"
vscode "rayhanw.erb-helpers"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "robertz.code-snapshot"
vscode "rvest.vs-code-prettier-eslint"
vscode "sdras.night-owl"
vscode "setobiralo.erb-commenter"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shopify.polaris-for-vscode"
vscode "shopify.ruby-extensions-pack"
vscode "shopify.ruby-lsp"
vscode "sianglim.slim"
vscode "sissel.shopify-liquid"
vscode "sorbet.sorbet-vscode-extension"
vscode "stylelint.vscode-stylelint"
vscode "swiftlang.swift-vscode"
vscode "teabyii.ayu"
vscode "teamsdevapp.vscode-ai-foundry"
vscode "timonwong.shellcheck"
vscode "tomoki1207.pdf"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vense.rails-snippets"
vscode "vincaslt.highlight-matching-tag"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vitest.explorer"
vscode "vknabel.vscode-swiftlint"
vscode "vortizhe.simple-ruby-erb"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vstirbu.vscode-mermaid-preview"
vscode "waderyan.gitblame"
vscode "webhint.vscode-webhint"
vscode "wix.vscode-import-cost"
vscode "xabikos.javascriptsnippets"
vscode "xabikos.reactsnippets"
vscode "yoavbls.pretty-ts-errors"
vscode "zenstack.zenstack"
vscode "zneuray.erb-vscode-snippets"
vscode "zxh404.vscode-proto3"
