# frozen_string_literal: true
# run `brew bundle` to run this file

tap "1password/tap"
tap "heroku/brew"
tap "infisical/get-cli"
tap "romkatv/powerlevel10k"
tap "shopify/shopify"

brew "bat"
brew "boost"
brew "cask"
brew "cloc"
brew "diff-so-fancy"
brew "edencommon"
brew "emacs"
brew "fb303"
brew "fbthrift"
brew "fizz"
brew "flyctl"
brew "folly"
brew "fzf"
brew "gh"
brew "gist"
brew "git"
brew "glib"
brew "gnupg"
brew "gnutls"
brew "ghostscript"
brew "guile"
brew "harfbuzz"
brew "hdf5"
brew "imagemagick"
brew "ios-deploy"
brew "jless"
brew "jq"
brew "libassuan"
brew "libevent"
brew "libfido2"
brew "libgsf"
brew "libheif"
brew "libidn"
brew "libxml2"
brew "libyaml"
brew "mas"
brew "mermaid-cli"
brew "mysql", restart_service: true
brew "open-mpi"
brew "openssl"
brew "openssl@3"
brew "openslide"
brew "p11-kit"
brew "pango"
brew "poppler"
brew "postgresql", restart_service: true, link: true
brew "powerlevel10k"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pygments"
brew "python@3.10"
brew "python@3.11"
brew "python@3.12"
brew "python@3.9"
brew "redis", restart_service: true
brew "ruby-build"
brew "ruby-install"
brew "rust"
brew "shared-mime-info"
brew "sqlite"
brew "thefuck"
brew "tree"
brew "unbound"
brew "vips"
brew "watchman"
brew "wget"
brew "wangle"
brew "yarn"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

cask "1password"
cask "1password-cli"
cask "figma"
cask "firefox@developer-edition"
cask "google-chrome"
cask "ngrok"
cask "nordvpn"
cask "notion"
cask "numi"
cask "nucleo"
cask "postman"
cask "raycast"
cask "rectangle"
cask "spotify"
cask "sublime-text"
cask "visual-studio-code"
cask "whatsapp"
cask "zoom"

mas "Developer", id: 640199958
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Shazam", id: 897118787

vscode "aaron-bond.better-comments"
vscode "aki77.rails-db-schema"
vscode "alefragnani.project-manager"
vscode "alexcvzz.vscode-sqlite"
vscode "andrewmcgoveran.react-component-generator"
vscode "aslamanver.vsc-export"
vscode "atomiks.moonlight"
vscode "benjaminbenais.copilot-theme"
vscode "bourhaouta.tailwindshades"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "bradlc.vscode-tailwindcss"
vscode "bung87.vscode-gemfile"
vscode "castwide.solargraph"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "clinyong.vscode-css-modules"
vscode "csstools.postcss"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "deque-systems.vscode-axe-linter"
vscode "durzn.brackethighlighter"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "file-icons.file-icons"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "fwcd.kotlin"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gracefulpotato.rbs-syntax"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-execution"
vscode "graphql.vscode-graphql-syntax"
vscode "gusto.packwerk-vscode"
vscode "hridoy.rails-snippets"
vscode "ibm.output-colorizer"
vscode "itarato.byesig"
vscode "jasonnutter.search-node-modules"
vscode "jawandarajbir.react-vscode-extension-pack"
vscode "jomeinaster.bracket-peek"
vscode "kaiwood.endwise"
vscode "kamikillerto.vscode-colorize"
vscode "kingwl.vscode-vitest-runner"
vscode "kohlbachjan.the-best-theme"
vscode "koichisasada.vscode-rdbg"
vscode "luxcium.pop-n-lock-theme-vscode"
vscode "mgmcdermott.vscode-language-babel"
vscode "mikestead.dotenv"
vscode "mkxml.vscode-filesize"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.sublime-keybindings"
vscode "ms-vscode.vscode-speech"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "naumovs.color-highlight"
vscode "neotan.vscode-auto-restart-typescript-eslint-servers"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "qwtel.sqlite-viewer"
vscode "rangav.vscode-thunder-client"
vscode "rayhanw.erb-helpers"
vscode "redhat.java"
vscode "robertz.code-snapshot"
vscode "rvest.vs-code-prettier-eslint"
vscode "sdras.night-owl"
vscode "setobiralo.erb-commenter"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shopify.polaris-for-vscode"
vscode "shopify.ruby-extensions-pack"
vscode "shopify.ruby-lsp"
vscode "sianglim.slim"
vscode "sissel.shopify-liquid"
vscode "sorbet.sorbet-vscode-extension"
vscode "sswg.swift-lang"
vscode "stylelint.vscode-stylelint"
vscode "teabyii.ayu"
vscode "timonwong.shellcheck"
vscode "tomoki1207.pdf"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vense.rails-snippets"
vscode "vincaslt.highlight-matching-tag"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vitest.explorer"
vscode "vknabel.vscode-swiftlint"
vscode "vortizhe.simple-ruby-erb"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
